data=[ {'姓名':'趙大','國文':78,'英文':45,'數學':68},
       {'姓名':'張三','國文':22,'英文':88,'數學':81},
       {'姓名':'王五','國文':34,'英文':90,'數學':33},
       {'姓名':'李四','國文':22,'英文':63,'數學':89} ]

#串列元組反序法
a=sorted( [ (z['數學'],z['英文'],z['國文'],z['姓名']) for z in data], reverse=True )
print(f'{a[0][-1]}>={a[1][-1]}>={a[2][-1]}>={a[-1][-1]}')

#匿名函數負數法
a=sorted( data, key=lambda x:( -x['數學'], -x['英文'], -x['國文'] ) )
print(f"{a[0]['姓名']}>={a[1]['姓名']}>={a[2]['姓名']}>={a[-1]['姓名']}")

#函數反序法
def tp(x):
    return ( x['數學'], x['英文'], x['國文'] )

a=sorted( data, key=tp, reverse=True )
print(f"{a[0]['姓名']}>={a[1]['姓名']}>={a[2]['姓名']}>={a[-1]['姓名']}")